; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-7-2-3-9-9-4) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 depot4 depot5 depot6 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 - Pallet
	crate0 crate1 crate2 crate3 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 depot4)
	(clear pallet4)
	(at pallet5 depot5)
	(clear crate2)
	(at pallet6 depot6)
	(clear crate3)
	(at pallet7 distributor0)
	(clear pallet7)
	(at pallet8 distributor1)
	(clear pallet8)
	(at truck0 depot2)
	(at truck1 distributor1)
	(at truck2 depot5)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 depot4)
	(available hoist4)
	(at hoist5 depot5)
	(available hoist5)
	(at hoist6 depot6)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at hoist8 distributor1)
	(available hoist8)
	(at crate0 depot6)
	(on crate0 pallet6)
	(at crate1 depot6)
	(on crate1 crate0)
	(at crate2 depot5)
	(on crate2 pallet5)
	(at crate3 depot6)
	(on crate3 crate1)
)

(:goal (and
		(on crate0 pallet2)
		(on crate2 pallet5)
		(on crate3 pallet7)
	)
))

; plan
1. (lift hoist6 crate3 crate1 depot6)
   deleted: (at crate3 depot6) (available hoist6) (on crate3 crate1) (clear crate3)
   added: (lifting hoist6 crate3) (clear crate1)
   goals met: 1 of 3
2. (drive truck0 depot2 depot6)
   deleted: (at truck0 depot2)
   added: (at truck0 depot6)
   goals met: 1 of 3
3. (load hoist6 crate3 truck0 depot6)
   deleted: (lifting hoist6 crate3)
   added: (in crate3 truck0) (available hoist6)
   goals met: 1 of 3
4. (lift hoist6 crate1 crate0 depot6)
   deleted: (at crate1 depot6) (available hoist6) (on crate1 crate0) (clear crate1)
   added: (lifting hoist6 crate1) (clear crate0)
   goals met: 1 of 3
5. (load hoist6 crate1 truck0 depot6)
   deleted: (lifting hoist6 crate1)
   added: (in crate1 truck0) (available hoist6)
   goals met: 1 of 3
6. (lift hoist6 crate0 pallet6 depot6)
   deleted: (at crate0 depot6) (available hoist6) (on crate0 pallet6) (clear crate0)
   added: (lifting hoist6 crate0) (clear pallet6)
   goals met: 1 of 3
7. (load hoist6 crate0 truck0 depot6)
   deleted: (lifting hoist6 crate0)
   added: (in crate0 truck0) (available hoist6)
   goals met: 1 of 3
8. (drive truck0 depot6 depot2)
   deleted: (at truck0 depot6)
   added: (at truck0 depot2)
   goals met: 1 of 3
9. (unload hoist2 crate0 truck0 depot2)
   deleted: (available hoist2) (in crate0 truck0)
   added: (lifting hoist2 crate0)
   goals met: 1 of 3
10. (drop hoist2 crate0 pallet2 depot2)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (at crate0 depot2) (available hoist2) (on crate0 pallet2) (clear crate0)
   goals met: 2 of 3
11. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 2 of 3
12. (unload hoist7 crate3 truck0 distributor0)
   deleted: (available hoist7) (in crate3 truck0)
   added: (lifting hoist7 crate3)
   goals met: 2 of 3
13. (drop hoist7 crate3 pallet7 distributor0)
   deleted: (lifting hoist7 crate3) (clear pallet7)
   added: (at crate3 distributor0) (available hoist7) (on crate3 pallet7) (clear crate3)
   goals met: 3 of 3
